<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a03b87bd44447d9bc8d918552fcf1d57a24d00c7e893fcec6ce9790532a6e664","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #554 at https://github.com/cal-itp/data-infra/actions/runs/17504594216","plan_out_hash":"0b3e150730c487ec6220548e8295bce5c597d930454e1851731e3774e49da4d1","plan_hash":"289c3f92841ef58d16aaba8afe01f03521ef707620ab76d3d4ce0cf9bd035666","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_and_validate_rt_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "J05Kfg==" -> (known after apply)
!~      detect_md5hash      = "4AECYFCGCHhAUElBpnttDA==" -> "different hash"
!~      generation          = 1757099627103079 -> (known after apply)
        id                  = "calitp-staging-composer-dags/parse_and_validate_rt_v2/METADATA.yml"
!~      md5hash             = "4AECYFCGCHhAUElBpnttDA==" -> (known after apply)
        name                = "dags/parse_and_validate_rt_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #554](https://github.com/cal-itp/data-infra/actions/runs/17504594216)